load-test.yml
config:
  target: "https://backend-production-69b89.up.railway.app"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up load"
    - duration: 120
      arrivalRate: 50
      name: "Peak load"
scenarios:
  - name: "Get students"
    flow:
      - get:
          url: "/api/v1/students/"